{
  "entries": [
    {
      "id": 1,
      "date": "07/10/2019",
      "concept": " Git, GitHub, Flexbox, and Teamwork",
      "entry": "Used the aforementioned technologies to build a website with 3 other team members",
      "mood": "excited"
    },
    {
      "id": 3,
      "date": "07/12/2019",
      "concept": "object and array manipulation",
      "entry": "book 2 chapter 2: Practiced extracting and manipulatind data in objects and arrays.",
      "mood": "ok"
    },
    {
      "id": 4,
      "date": "07/13/2019",
      "concept": "Daily Journal",
      "entry": "Weekend: worked on styling my journal and learned some cool css tricks. I love styling!",
      "mood": "excited"
    },
    {
      "id": 5,
      "date": "07/15/2019",
      "concept": "Functions",
      "entry": "Learned about pure and impure functions. Worked more with template literals. Did several exercises ",
      "mood": "ok"
    },
    {
      "id": 6,
      "date": "07/16/2019",
      "concept": "More Functions",
      "entry": "Began the day with lightning exercises Finished book 2 chapter 4. Did several exercises ",
      "mood": "ok"
    },
    {
      "id": 7,
      "date": "07/17/2019",
      "concept": "Objet Oriented Programming",
      "entry": "Book 2 chapter 6 and 7. Learned about objects representing things, and building DOM components",
      "mood": "ok"
    },
    {
      "id": 8,
      "date": "07/18/2019",
      "concept": "Json",
      "entry": "Book 2 chapter 9: the content didn't seem too hard to understand, but computer problem made me miss the lesson",
      "mood": "stressed"
    },
    {
      "id": 9,
      "date": "07/19/2019",
      "concept": "Fetch",
      "entry": "Book 2 chapter 10: the content didn't seem too hard to understand, but computer problem made me miss the lesson",
      "mood": "stressed"
    },
    {
      "id": 10,
      "date": "07/22/2019",
      "concept": "Group Project: Fetching Data",
      "entry": "Not a sprint, but a dash. Worked with two other team members. We built a web site that retreived data via fetch and displayed blog entries, images, and a list of to do's. I like group projects because it helps me realize that I'm not alone in feeling like I don't know what I'm doing. Plus, I always learn.",
      "mood": "excited"
    },
    {
      "id": 11,
      "date": "07/23/2019",
      "concept": "Event Listeners",
      "entry": "Book 2: Chapter 12. class goes too fast sometimes. I feel dumb because I can't keep up. I got behind on Fetch homework because of the computer problem so I didn't work on event listeners in class. I worked on them at home and I had a hard time. I should know how to write event listeners because I have prior knowledge of them. Days like this make me feel like I'm not smart enough to do this",
      "mood": "stressed"
    },
    {
      "id": 12,
      "date": "07/24/2019",
      "concept": "Capturing User Input",
      "entry": "Book 2: Chapter 13. Still behind...it's been such a bad week. Jenna gave me a pep talk. She knows I'm a flight risk, so she keeps an eye on me. She knows what we're going through because she went through it, too. She's awsome! ",
      "mood": "stressed"
    },
    {
      "id": 13,
      "date": "07/25/2019",
      "concept": "Modules",
      "entry": "Book 2: Chapter 13. The concept is logical but then we started applying it in class. I'm tired from staying up too late catching up on home work. Again, I can't keep up in class. Thank God saved by a visitor talk! Alumni came to talk to us about the importance of networking. ",
      "mood": "stressed"
    },
    {
      "id": 14,
      "date": "07/26/2019",
      "concept": "Group Project",
      "entry": "Welcome to Nashville project. I'm on a team with two other people. We're applying everything we've learned so far. API's, inputs, event listeners, factory functions, modules. We're building a Web site that uses 3 API's to import data, and outputing results based on what the user selects. Each of us is responsible for a page. I'm nervous because I'm unclear on some of the concepts I'm using but I'm also excited because I'm learning a lot. I'm feeling much better.",
      "mood": "ok"
    },
    {
      "id": 15,
      "date": "07/28/2019",
      "concept": "Weekend",
      "entry": " I worked ALL weekend on my part of the project and I still didn't figure it out. I'm so close, but so far away. I stoped trying to solve the problem and began to style the site because I was spinning my wheels and not getting anywhere. It may not work but it looks good! I think I'm really close so hopefully someone at school can help me tomorrow. I'm trying to have a better attitude. If I can't figure somtthing out, it doesn't mean I'm dumb. It just means I have more to learn.Got caught up on my homework!",
      "mood": "excited"
    },
    {
      "id": 16,
      "date": "07/29/2019",
      "concept": "Group Project",
      "entry": "Welcome to Nashville project. Still working on group project. Decided to use a different API and successfully finished my part of the project",
      "mood": "ok"
    },
    {
      "id": 17,
      "date": "07/30/2019",
      "concept": "Group Project Presentation",
      "entry": "Welcome to Nashville project. My group and I were successful in meeting all the requirements of the project. The presentation went well. Spent the rest of the day working on linkedIn",
      "mood": "ok"
    },
    {
      "id": 18,
      "date": "07/31/2019",
      "concept": "Individual Reviews",
      "entry": "Began day in Hackery. We're supposed to be working on a coding project they gave us to do while they do individual reviews, but I'm finishing my LinkedIn profile: it's due Friday. I will start the project later: it's too noisey in here to think! My review was ok, except Steve said that Jenna and Brian said I don't listen to their advice. I don't know what they're talking about, maybe I just didn't understand. Went back to class after lunch we went over Book 2 Chapter 1",
      "mood": "stresed"
    },
    {
      "date": "2019-08-05",
      "concept": "ES6 Modules",
      "entry": "Today we learned about exporting and importing things we need to male the modules work. Get rid of script tags and import",
      "mood": "ok",
      "id": 21
    }
  ]
}